RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_enet.h
/*!
    \file    gd32h77x_78x_enet.h
    \brief   definitions for the ENET

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_ENET_H
#define GD32H77X_78X_ENET_H

#include "gd32h77x_78x.h"

/* ENET definitions */
#define ENET0                            ENET_BASE
#define ENET1                            (ENET_BASE + 0x00002000U)

/* registers definitions */
#define ENET_MAC_CFG(enetx)              REG32((enetx) + 0x00000000U)           /*!< ethernet MAC configuration register */
#define ENET_MAC_FRMF(enetx)             REG32((enetx) + 0x00000004U)           /*!< ethernet MAC frame filter register */
#define ENET_MAC_HLH(enetx)              REG32((enetx) + 0x00000008U)           /*!< ethernet MAC hash list high register */
#define ENET_MAC_HLL(enetx)              REG32((enetx) + 0x0000000CU)           /*!< ethernet MAC hash list low register */
#define ENET_MAC_PHY_CTL(enetx)          REG32((enetx) + 0x00000010U)           /*!< ethernet MAC PHY control register */
#define ENET_MAC_PHY_DATA(enetx)         REG32((enetx) + 0x00000014U)           /*!< ethernet MAC PHY data register */
#define ENET_MAC_FCTL(enetx)             REG32((enetx) + 0x00000018U)           /*!< ethernet MAC flow control register */
#define ENET_MAC_VLT(enetx)              REG32((enetx) + 0x0000001CU)           /*!< ethernet MAC VLAN tag register */
#define ENET_MAC_RWFF(enetx)             REG32((enetx) + 0x00000028U)           /*!< ethernet MAC remote wakeup frame filter register */
#define ENET_MAC_WUM(enetx)              REG32((enetx) + 0x0000002CU)           /*!< ethernet MAC wakeup management register */
#define ENET_MAC_DBG(enetx)              REG32((enetx) + 0x00000034U)           /*!< ethernet MAC debug register */
#define ENET_MAC_INTF(enetx)             REG32((enetx) + 0x00000038U)           /*!< ethernet MAC interrupt flag register */
#define ENET_MAC_INTMSK(enetx)           REG32((enetx) + 0x0000003CU)           /*!< ethernet MAC interrupt mask register */
#define ENET_MAC_ADDR0H(enetx)           REG32((enetx) + 0x00000040U)           /*!< ethernet MAC address 0 high register */
#define ENET_MAC_ADDR0L(enetx)           REG32((enetx) + 0x00000044U)           /*!< ethernet MAC address 0 low register */
#define ENET_MAC_ADDR1H(enetx)           REG32((enetx) + 0x00000048U)           /*!< ethernet MAC address 1 high register */
#define ENET_MAC_ADDR1L(enetx)           REG32((enetx) + 0x0000004CU)           /*!< ethernet MAC address 1 low register */
#define ENET_MAC_ADDR2H(enetx)           REG32((enetx) + 0x00000050U)           /*!< ethernet MAC address 2 high register */
#define ENET_MAC_ADDR2L(enetx)           REG32((enetx) + 0x00000054U)           /*!< ethernet MAC address 2 low register */
#define ENET_MAC_ADDR3H(enetx)           REG32((enetx) + 0x00000058U)           /*!< ethernet MAC address 3 high register */
#define ENET_MAC_ADDR3L(enetx)           REG32((enetx) + 0x0000005CU)           /*!< ethernet MAC address 3 low register */
#define ENET_MAC_FCTH(enetx)             REG32((enetx) + 0x00001080U)           /*!< ethernet MAC flow control threshold register */
#define ENET_MSC_CTL(enetx)              REG32((enetx) + 0x00000100U)           /*!< ethernet MSC control register */
#define ENET_MSC_RINTF(enetx)            REG32((enetx) + 0x00000104U)           /*!< ethernet MSC receive interrupt flag register */
#define ENET_MSC_TINTF(enetx)            REG32((enetx) + 0x00000108U)           /*!< ethernet MSC transmit interrupt flag register */
#define ENET_MSC_RINTMSK(enetx)          REG32((enetx) + 0x0000010CU)           /*!< ethernet MSC receive interrupt mask register */
#define ENET_MSC_TINTMSK(enetx)          REG32((enetx) + 0x00000110U)           /*!< ethernet MSC transmit interrupt mask register */
#define ENET_MSC_SCCNT(enetx)            REG32((enetx) + 0x0000014CU)           /*!< ethernet MSC transmitted good frames after a single collision counter register */
#define ENET_MSC_MSCCNT(enetx)           REG32((enetx) + 0x00000150U)           /*!< ethernet MSC transmitted good frames after more than a single collision counter register */
#define ENET_MSC_TGFCNT(enetx)           REG32((enetx) + 0x00000168U)           /*!< ethernet MSC transmitted good frames counter register */
#define ENET_MSC_RFCECNT(enetx)          REG32((enetx) + 0x00000194U)           /*!< ethernet MSC received frames with CRC error counter register */
#define ENET_MSC_RFAECNT(enetx)          REG32((enetx) + 0x00000198U)           /*!< ethernet MSC received frames with alignment error counter register */
#define ENET_MSC_RGUFCNT(enetx)          REG32((enetx) + 0x000001C4U)           /*!< ethernet MSC received good unicast frames counter register */
#define ENET_PTP_TSCTL(enetx)            REG32((enetx) + 0x00000700U)           /*!< ethernet PTP time stamp control register */
#define ENET_PTP_SSINC(enetx)            REG32((enetx) + 0x00000704U)           /*!< ethernet PTP subsecond increment register */
#define ENET_PTP_TSH(enetx)              REG32((enetx) + 0x00000708U)           /*!< ethernet PTP time stamp high register */
#define ENET_PTP_TSL(enetx)              REG32((enetx) + 0x0000070CU)           /*!< ethernet PTP time stamp low register */
#define ENET_PTP_TSUH(enetx)             REG32((enetx) + 0x00000710U)           /*!< ethernet PTP time stamp update high register */
#define ENET_PTP_TSUL(enetx)             REG32((enetx) + 0x00000714U)           /*!< ethernet PTP time stamp update low register */
#define ENET_PTP_TSADDEND(enetx)         REG32((enetx) + 0x00000718U)           /*!< ethernet PTP time stamp addend register */
#define ENET_PTP_ETH(enetx)              REG32((enetx) + 0x0000071CU)           /*!< ethernet PTP expected time high register */
#define ENET_PTP_ETL(enetx)              REG32((enetx) + 0x00000720U)           /*!< ethernet PTP expected time low register */
#define ENET_PTP_TSF(enetx)              REG32((enetx) + 0x00000728U)           /*!< ethernet PTP time stamp flag register */
#define ENET_PTP_PPSCTL(enetx)           REG32((enetx) + 0x0000072CU)           /*!< ethernet PTP PPS control register */
#define ENET_DMA_BCTL(enetx)             REG32((enetx) + 0x00001000U)           /*!< ethernet DMA bus control register */
#define ENET_DMA_TPEN(enetx)             REG32((enetx) + 0x00001004U)           /*!< ethernet DMA transmit poll enable register */
#define ENET_DMA_RPEN(enetx)             REG32((enetx) + 0x00001008U)           /*!< ethernet DMA receive poll enable register */
#define ENET_DMA_RDTADDR(enetx)          REG32((enetx) + 0x0000100CU)           /*!< ethernet DMA receive descriptor table address register */
#define ENET_DMA_TDTADDR(enetx)          REG32((enetx) + 0x00001010U)           /*!< ethernet DMA transmit descriptor table address register */
#define ENET_DMA_STAT(enetx)             REG32((enetx) + 0x00001014U)           /*!< ethernet DMA status register */
#define ENET_DMA_CTL(enetx)              REG32((enetx) + 0x00001018U)           /*!< ethernet DMA control register */
#define ENET_DMA_INTEN(enetx)            REG32((enetx) + 0x0000101CU)           /*!< ethernet DMA interrupt enable register */
#define ENET_DMA_MFBOCNT(enetx)          REG32((enetx) + 0x00001020U)           /*!< ethernet DMA missed frame and buffer overflow counter register */
#define ENET_DMA_RSWDC(enetx)            REG32((enetx) + 0x00001024U)           /*!< ethernet DMA receive state watchdog counter register */
#define ENET_DMA_CTDADDR(enetx)          REG32((enetx) + 0x00001048U)           /*!< ethernet DMA current transmit descriptor address register */
#define ENET_DMA_CRDADDR(enetx)          REG32((enetx) + 0x0000104CU)           /*!< ethernet DMA current receive descriptor address register */
#define ENET_DMA_CTBADDR(enetx)          REG32((enetx) + 0x00001050U)           /*!< ethernet DMA current transmit buffer address register */
#define ENET_DMA_CRBADDR(enetx)          REG32((enetx) + 0x00001054U)           /*!< ethernet DMA current receive buffer address register */

